Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Similar to above but clearly delimits where n ends: useful when the following character(s) is(are) digits.
fr: Similaire au précédent mais délimite clairement n : impérative lorsque les caractères qui suivent sont des chiffres.

source: References a previous capturing group by its relative number.
fr: Référence au numéro relatif d'un groupe précédemment capturé.

source: References a previous capturing group by its name.
fr: Référence au nom d'un groupe précédemment capturé.

source: References to subroutines
fr: Référence à un sous-programme

source: Capturing groups are subpatterns that can be invoked (possibly recursively) exactly like subroutines in a programming language.
fr: Les groupes capturant peuvent être invoqués (éventuellement de manière récursive) exactement comme des sous-programmes dans un langage de programmation.

source: The subpattern is simply re-run at the current matching point.
fr: Le sous-modèle est tout simplement ré-exécuté au point courant dans le sujet.

source: See reference documentation for details and examples.
fr: Voir la documentation de référence pour des détails et des exemples.

source: Recurses into the entire regular expression.
fr: Récursivité vers l'expression régulière entière.

source: Calls subpattern by absolute number.
fr: Appelle un sous-modèle par son numéro absolu.

source: Calls subpattern by relative number.
fr: Appelle un sous-modèle par son numéro relatif.

source: Calls subpattern by name.
fr: Appelle un sous-modèle par son nom.

source: Anchors and assertions
fr: Ancrages et assertions

source: Anchors and assertions are tests that do not change the matching position and therefore do not consume nor capture anything.
fr: Les ancrages et les assertions sont des contraintes, des tests qui ne changent pas la position dans le sujet et donc ne consomment ni ne capturent quoi que ce soit.

source: Anchors test the position of the current matching point.
fr: Un ancrage teste la position courante dans le sujet.

source: Outside a character class, the caret matches at the start of the subject text, and also just after a non-final newline sequence if option (?m) is active.
fr: En dehors d'une classe de caractère, ce test est satisfait si la position courante est le début du sujet, mais également après une séquence de saut de ligne non-finale si l'option (?m) est active.

source: By default the newline sequence is @CRLF.
fr: Par défaut, la séquence de saut de ligne est soit @CRLF, soit @CR ou @LF isolés.

source: Inside a character class, a leading ^ complements the class (excludes the characters listed there).
fr: Dans une classe de caractères, un caret ^ complémente la classe (exclut les caractères qu'elle représente) s'il figure en première position, correspond littéralement s'il se trouve dans une autre position.

source: Outside a character class, the dollar matches at the end of the subject text, and also just before a newline sequence if option (?m) is active.
fr: En dehors d'une classe de caractères, ce test est satisfait si la position courante est à la fin du texte sujet, mais également avant une séquence de saut de ligne si l'option (?m) est active.

source: Inside a character class, $ means itself, a dollar sign.
fr: Dans une classe de caractères, $ correspond au signe dollar lui-même.

source: Matches only at the absolute beginning of subject string, irrespective of the multiline option (?m).
fr: Test satisfait si la position courante est le début du sujet, indépendament de l'option multiligne (?m).

source: Will never match if offset is not 1.
fr: Échoue forcément si l'offset n'est pas 1.

source: Matches when the current position is the first matching position in subject.
fr: Test satisfait si la position courante est la première correspondance trouvée dans le sujet.

source: Matches only at end of subject string, irrespective of the multiline option (?m).
fr: Test satisfait si la position courante est à la fin de la chaîne sujet, indépendament de l'option multiligne (?m).

source: Matches only at end of subject string, or before a newline sequence at the end, irrespective of the multiline option (?m).
fr: Test satisfait si la position courante est à la fin de la chaîne sujet ou avant une séquence de saut de ligne, indépendament de l'option multiligne (?m).

source: Assertions test the character(s) preceding (look-behind), at (word boundary) or following (look-ahead) the current matching point.
fr: Une assertions teste les caractères qui précédent (look-behind), une frontière de mot (\b) ou qui suivent (look-ahead) le point courant dans le sujet.

source: Matches at a "word" boundary, i.e. between characters not both \w or \W.
fr: Test satisfait si la position courante est à la limite d'un 'mot', soit entre des caractères non tous deux \w ou \W.

source: See \w for the meaning of "word".
fr: Voir \w pour la signification de 'mot'.

source: Inside a character class, \b means "backspace" (Chr(8)).
fr: Dans une classe de caractères, \b est le caractère de contrôle retour arrière (Chr(8)).

source: Matches when not at a word boundary.
fr: Test satisfait si la position courante n'est pas à la limite d'un 'mot'.

source: Positive look-ahead: matches when the subpattern X matches starting at the current position.
fr: Look-ahead positif : test satisfait si le sous-modèle X correspond à partir de la position courante.

source: Negative look-ahead: matches when the subpattern X does not match starting at the current position.
fr: Look-ahead négatif : test satisfait si le sous-modèle X ne correspond pas à partir de la position courante.

source: Positive look-behind: matches when the subpattern X matches characters preceding the current position.
fr: Look-behind positif : test satisfait si le sous-modèle X correspond aux caractères qui précèdent la position courante.

source: Pattern X must match a fixed-length string, i.e. may not use any undefinite quantifier * + or ?.
fr: Le modèle X doit correspondre à une chaîne de longueur bornée, c'est-à-dire ne pas utiliser de quantificateurs indéfinis * + ou ?ou leurs équivalents.

source: Negative look-behind: matches when the subpattern X does not match characters preceding the current position.
fr: Look-behind négatif : test satisfait si le sous-modèle X ne correspond pas aux caractères qui précédent la position courante.

source: Resetting the match
fr: Ré-initialisation de la correspondance

source: There are situations where it is necessary to "forget" that something has matched so far, in order to match more pertinent data later in the subject string.
fr: Il y a des situations où il est nécessaire "d'oublier" qu'une correspondance a été trouvé jusqu'à présent, afin de trouver une correspondance plus pertinente plus loin dans la chaîne sujet.

source: Resets start of match at the current point in subject string.
fr: Ré-initialise le démarrage de la recherche au point courant du sujet.

source: Note that groups already captured are left alone and still populate the returned array; it is therefore always possible to backreference to them later on.
fr: Notez que les groupes déjà capturéz sont conservés dans le tableau renvoyé ; il est donc toujours possible d'y faire référence plus tard.

source: Action of \K is similar but not identical to a look-behind, in that \K can work on alternations of varying lengths.
fr: L'action de \K est similaire mais non identique à un look-behind, en ce que \K permet de travailler avec un sous-modèle de longueur non bornée.

source: Conditional patterns
fr: Blocs conditionnels

source: These constructs are similar to If...EndIf and If...Else...EndIf blocks.
fr: Ces constructions sont similaires aux blocs If...EndIf et If...Else...EndIf.

source: Allows conditional execution of pattern.
fr: Permet une exécution conditionnelle de modèle_si_vrai.

source: Chooses between distinct patterns depending on the result of (condition).
fr: Applique l'un des modèles suivant le résultat de (condition).

source: where (condition) can be any of the following form:
fr: où (condition) peut être de la forme suivante :

source: Tests whether the capturing group with absolute number n matched.
fr: Teste si le groupe de capture de numéro absolu n permet la correspondance.

source: Tests whether the capturing group with relative number +n matched.
fr: Teste si le groupe de capture de numéro relatif +n permet la correspondance.

source: Tests whether the capturing group with relative number -n matched.
fr: Teste si le groupe de capture de numéro relatif -n permet la correspondance.

source: Tests whether the capturing group with name name matched.
fr: Teste si le groupe de capture nommé nom permet la correspondance.

source: Tests whether any kind of recursion occured.
fr: Teste si une quelconque récurrence s'est produite.

source: Tests whether the most recent recursion was for capturing group with absolute number n.
fr: Teste si la plus récente récurrence portait sur la capture par le groupe de numéro absolu n.

source: Tests whether the most recent recursion was for capturing group with name name.
fr: Teste si la plus récente récurrence portait sur la capture par le groupe de nom name.

source: Used without no-pattern, permits definition of a subroutine useable from elsewhere.
fr: Utilisée sans modèle_si_faux : permet la définition d'un sous-programme nommé utilisable par ailleurs.

source: "(?x) (?(DEFINE) (?<byte> 2[0-4]\d | 25[0-5] | 1\d\d | [1-9]?\d) )" defines a subroutine named "byte" which matches any component of an IPv4 address.
fr: "(?x) (?(DEFINE) (?<octet> 2[0-4]\d | 25[0-5] | 1\d\d | [1-9]?\d) )" définit un sous-programme nommé "octet" qui permet une correspondance avec un composant numérique d'adresse IPv4.

source: Then an actual address can be matched by "\b (?&byte) (\.(?&byte)){3} \b".
fr: Ensuite, une adresse réelle peut être recherchée par "\b (?&byte) (\.(?&byte)){3} \b".

source: Here assertion is one of positive or negative, look-ahead or look-behind assertion.
fr: Ici assertion est une assertion positive ou negative, look-ahead ou look-behind.

source: Miscellaneous advanced features
fr: Fonctionnalités avancées diverses

source: These options, escapes and constructs are simply mentioned here; see reference documentation for detail on why, when and how to use them, if at all.
fr: Les options, les escapes et les constructions sont simplement mentionnés ici ; voir la documentation de référence pour comprendre pourquoi, quand et comment les utiliser, voire pas du tout.

source: Uncommon settings and options
fr: Paramètres et options peu fréquents

source: Causes some out-of-context sequences to raise an error, instead of being benign.
fr: Permet d'assigner un même nom à plusieurs groupes ou sous-programme (non détaillé ici).

source: Enables Javascript compatibility (not discussed further here).
fr: Les éléments hors contexte provoquent une erreur, au lieu d'être ignorés.

source: Limits number of matches to n.
fr: Autorise une compatibilité partielle avec les expressions régulières Javascript (non détaillé ici).

source: Limits recursion to n levels.
fr: Limite à n le nombre de correspondances trouvées.

source: Disables several optimizations (not discussed further here).
fr: Limite la récursion à n niveaux.

source: Backtracking control
fr: Désactive plusieurs optimisations (non détaillé ici).

source: Forces an immediate match success in the current subroutine or top-level pattern.
fr: Contrôle du retour arrière (backtracking)

source: Forces an immediate match failure.
fr: Force le succès immédiat de la correspondance dans le sous-programme en cours ou dans le modèle de premier niveau.

source: (See reference documentation.)
fr: Force l'échec immédiat de la recherche.

source: General comments about AutoIt regular expressions
fr: (Voir la documentation de référence.)

source: When UCP is active, case sense matching applies to the full Unicode plane 0.There are also a small number of many-to-one mappings in Unicode, like the Greek lowercase letter sigma; these are supported by PCRE with UCP enabled.
fr: Commentaires généraux sur les expressions régulières AutoIt

source: Alternate forms of several escapes exist for compatibility with Perl, Ruby, Python, JavaScript, .
fr: Lorsque UCP est actif, la sensibilité à la casse s'applique sur le plan 0 du jeu Unicode.

source: NET and other engines.Do not use constructs not listed here: some will simply not work, some will supply wrong results, some will cause severe issues or merely crash.
fr: Il y a aussi un petit nombre de correspondances bi-univoques dans Unicode, comme la lettre minuscule Grèque sigma (intermédiaire ou final) ; elles sont supportées par PCRE par l'option UCP.

source: The default newline convention is the unbreakable sequence @CRLF or a separate @CR or @LF.
fr: D'autres syntaxes existent dans d'autres dialectes tels Perl, Ruby, Python, JavaScript, .

source: Similarly \R matches the same set.
fr: NET et d'autres moteurs.

source: Know your data!If you know that your subjects use separate @LF or @CR to mean something else than a newline, you may have to change the newline convention and/or the matching of \R (see "Settings").
fr: Ne pas utiliser de constructions non énumérées ici : certaines ne fonctionneront simplement pas, certaines fourniront des résultats erronés, d'autres provoqueront des problèmes graves ou simplement un crash.

source: StringInStr(), StringRegExpReplace()
fr: Related

source: Option 1, using offset parameter
fr: Example

source: Option 2, single return, php/preg_match() style
fr: Option 1, utilisation du paramètre offset

source: Option 3, global return, old AutoIt style
fr: Option 2, retour simple, style php/preg_match()

source: Option 4, global return, php/preg_match_all() style
fr: Option 3, retour global, ancien style AutoIt

source: Replace text in a string based on regular expressions.
fr: Remplace du texte, dans une chaîne, selon une expression régulière donnée.

source: The regular expression to compare.
fr: L'expression régulière qui définit la recherche.

source: See StringRegExp for pattern definition characters.
fr: Consultez StringRegExp pour les caractères de définition du modèle.

source: The text to replace the regular expression matching text with.
fr: Le texte destiné à remplacer le texte trouvé par l'expression régulière.

source: To insert matched group text, \0 - \9 (or $0 - $9) can be used as back-references.(See remarks)
fr: Pour insérer un groupe de texte trouvé, \0 - \9 (ou $0 - $9) vous pouvez les utiliser comme références arrières.

source: The number of times to execute the replacement in the string.
fr: Le nombre de fois où exécuter le remplacement de la chaîne.

source: Use 0 for global replacement.
fr: Utilisez 0 pour un remplacement global.

source: an updated string based on regular expressions.
fr: Retourne la chaîne modifiée selon l'expression régulière.

source: Check @extended for the number of replacements performed.
fr: Testez @extended pour obtenir le nombre de remplacements effectués.

source: 2 = Pattern invalid.
fr: 2 = Modèle invalide.

source: To separate back-reference replacements from actual (replaced) numbers, wrap them with curly braces, i.e:
fr: Pour séparer les remplacements avec référence arrière des nombres (remplacés) actuels, les encadrer avec des accolades, exemple:

source: If a "\" needs to be in the replaced string it must be doubled.
fr: Si un "\" doit être remplacé dans la chaîne il doit être doublé.

source: This is a consequence of the back-references mechanism.
fr: Ceci est une conséquence du mécanisme de référence arrière.

source: The "\" and "$" replacement formats are the only valid back-references formats supported.
fr: Les formats de remplacement de "\" et "$" sont les seuls formats valides pour les références arrières supportées.

source: See also the Regular Expression tutorial, in which you can run a script to test your regular expression(s).
fr: Consultez aussi le tutoriel Expressions régulières, dans lequel vous pouvez exécuter un script pour tester votre expression régulière.

source: This example demonstrates a basic replacement.
fr: Cet exemple montre un remplacement de base.

source: It replaces the vowels aeiou
fr: Il remplace les voyelles aeiou

source: with the @ character.
fr: avec le caractère @.

source: The following example demonstrates using back-references to change the date
fr: L'exemple suivant illustre l'utilisation des références arrières pour changer la date

source: from MM/DD/YYYY to DD.
fr: de MM/DD/AAAA en DD.

source: The following example demonstrates the need to double backslash
fr: L'exemple suivant illustre la nécessité d'une double barre oblique inverse

source: Format the output.
fr: Formate la sortie.

source: Replaces substrings in a string.
fr: Remplace des sous-chaînes dans une chaîne.

source: The substring to search for or the character position to start the replacement.
fr: La sous-chaîne à rechercher ou la position du caractère de départ du remplacement.

source: The replacement string.
fr: La chaîne de remplacement.

source: The number of times to replace the searchstring.
fr: Le nombre de remplacement de la chaîne recherchée.

source: Use a negative occurrence to replace from the right side.
fr: Utiliser une occurrence négative pour remplacer à partir de la droite.

source: 0 = all searchstrings will be replaced (default)
fr: 0 = Toutes les occurrences seront remplacées (par défaut)

source: Returns the new string with the number of replacements performed stored in the @extended macro.
fr: Retourne la nouvelle chaîne, le nombre de remplacements effectués est stocké dans la macro @extended.

source: By default or if the occurrence is positive the search/replace is performed left-to-right.
fr: Par défaut ou si le paramètre occurrence est positif, la recherche/remplacement est effectuée de gauche à droite.

source: Thus, StringReplace("aaa", "aa", "bb") returns "bba"
fr: Ainsi, StringReplace("aaa", "aa", "bb") retourne "bba"

source: If the start method is used the occurrence and casesense parameters are ignored.
fr: Si la méthode de la position de départ est utilisée, les paramètres occurrence et casesense sont ignorés.

source: If the replacestring cannot be stored an empty string is returned and @error is set to 1.
fr: Si la chaîne de remplacement ne peut être stockée, une chaîne vide est retournée et @error est mis à 1.

source: Replace a blank space (' ') with a - (minus) character.
fr: Remplace un espace (' ') avec le caractère - (moins).

source: Reverses the contents of the specified string.
fr: Inverse le contenu de la chaîne spécifiée.

source: The string to reverse.
fr: La chaîne à inverser.

source: Changes the way the string is reversed
fr: Définit la façon dont la chaîne est inversée

source: 0 = reversed in full UTF-16 mode.
fr: 0 = inversée en mode full UTF-16.

source: (default)
fr: (par défaut)

source: 1 = a much faster method - only use if using UCS-2 text.
fr: 1 = une méthode plus rapide - à utiliser seulement pour du texte UCS-2.

source: Returns a reversed string.
fr: Retourne la chaîne inversée.

source: Reverse the string esreveR.
fr: Inverse la chaîne "esreveR".

source: Returns a number of characters from the right-hand side of a string.
fr: Retourne un nombre donné de caractères à partir de la droite d'une chaîne.

source: Returns a string containing the rightmost count characters of the string.
fr: Retourne une chaîne contenant le nombre souhaité de caractères les plus à droite de la chaîne.

source: Retrieve 5 characters from the right of the string.
fr: Récupére 5 caractères les plus à droite de la chaîne.

source: Splits up a string into substrings depending on the given delimiters.
fr: Découpe une chaîne en tableau de sous-chaînes selon des délimiteurs donnés.

source: One or more characters to use as delimiters (case sensitive).
fr: Un ou plusieurs caractères à utiliser comme délimiteurs (sensible à la casse).

source: Changes how the string split works, add multiple flag values together if required:
fr: Modifie le fonctionnement de la fonction, ajoutez plusieurs valeurs de flag ensemble si besoin:

source: $STR_CHRSPLIT (0) = each character in the delimiter string will mark where to split the string (default)
fr: $STR_CHRSPLIT (0) = chaque caractère dans la chaîne des délimiteurs marquera la coupure de la chaîne (par défaut).

source: $STR_ENTIRESPLIT (1) = entire delimiter string is needed to mark the split
fr: $STR_ENTIRESPLIT (1) = la chaîne entière des délimiteurs est nécessaire pour marquer la coupure.

source: $STR_NOCOUNT (2) = disable the return count in the first element - effectively makes the array 0-based (must use UBound() to get the size of the array in this case).
fr: $STR_NOCOUNT (2) = désactive le comptage du nombre d'éléments du tableau dans l'élément 0 - le tableau retourné devient alors de base 0 (vous devrez utiliser UBound() pour obtenir la taille du tableau dans ce cas).

source: Returns an array, by default the first element ($aArray[0]) contains the number of strings returned, the remaining elements ($aArray[1], $aArray[2], etc.) contain the delimited strings.
fr: Retourne un tableau, par défaut le premier élément $array[0] contient le nombre de chaînes retournées, les éléments qui restent $array[1], $array[2], etc.contiennent les chaînes découpées.

source: If the flag parameter is set to $STR_NOCOUNT (2) then the count is not returned in the first element.
fr: Si le paramètre 'flag' est défini à $STR_NOCOUNT (2), alors le comptage n'est pas retourné dans le premier élément.

source: If no delimiters were found then the @error flag is set to 1, count is equal to 1 ($aArray[0]) and the full string is returned ($aArray[1]).
fr: Si aucun délimiteur n'est trouvé, le flag @error est mis à 1, le compte est 1 ($array[0]) et la chaîne complète est retournée ($array[1]).

source: If you use an empty string "" for the delimiters, each character will be returned as an element.
fr: Si vous utilisez une chaîne vide "" comme délimiteur, chaque caractère sera retourné comme un élément.

source: If the delimiter string contains several characters function behaviour depends on the flag setting.
fr: Si la chaîne des délimiteurs contient plusieurs caractères, le comportement de la fonction dépend du paramètre flag.

source: If set to $STR_CHRSPLIT the string will be split at every instance of each of the individual characters in the delimiter - if set to $STR_ENTIRESPLIT then the string will only be split when the entire delimiter string is encountered.
fr: S'il est défini à $STR_CHRSPLIT la chaîne sera coupée à chaque instance de chaque caractère delimiteur - s'il est défini à $STR_ENTIRESPLIT alors la chaîne sera coupée seulement quand la chaîne entière des délimiteurs est rencontrée.

source: See second example below.
fr: Voir le second exemple ci-dessous.

source: Note that the macro @CRLF is actually a 2 character string, so unless the flag parameter to $STR_ENTIRESPLIT extra blank lines will be generated as the string is split on both @CR and @LF.
fr: Remarquez que la macro @CRLF est actuellement une chaîne de 2 caractères, aussi si le paramètre flag est défini à $STR_ENTIRESPLIT des lignes vides seront générées puisque la chaîne sera coupée à la fois par @CR et @LF.

source: StringSplit() is very useful as an alternative to StringInStr() as well as a means to populate an array.
fr: StringSplit() est une très bonne alternative à StringInStr() et comme moyen de remplissage d'un tableau.

source: Split the string of days using the delimiter "," and the default flag value.
fr: Diviser la chaîne de jour en utilisant le délimiteur \",\" et la valeur de l'indicateur de défaut.

source: Loop through the array returned by StringSplit to display the individual values.
fr: Boucle dans le tableau renvoyé par StringSplit pour afficher les valeurs individuelles.
